angular.ng-template
bradlc.vscode-tailwindcss
digitalbrainstem.javascript-ejs-support
donjayamanne.githistory
esbenp.prettier-vscode
evzen-wybitul.magic-racket
firsttris.vscode-jest-runner
grapecity.gc-excelviewer
gruntfuggly.todo-tree
igochkov.vscode-ebnf
lishizhen.racket-fmt
mechatroner.rainbow-csv
meganrogge.template-string-converter
mhutchie.git-graph
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
oxc.oxc-vscode
shopify.ruby-lsp
steoates.autoimport
unifiedjs.vscode-mdx
ziglang.vscode-zig